package syntax.level01.task33;

//Уровень 1 Лекция 3

/*Одной переменной не достаточно*/
/*Объяви переменные a, b типа int и переменную s типа String.
Сразу же в строке объявления присвой им любые разные значения.

Требования:
•	Объяви две переменные типа int.
•	Объяви одну переменную типа String.
•	Имена переменных типа int должны быть a и b.
•	Имя переменной типа String должно быть s.
•	Переменным сразу должны быть присвоены значения.*/
public class Solution {
    int a = 2;
    int b = 1;
    String s = "asdf";

}
