package Core.level4.task821;

/*
Singleton
Класс является синглтоном (реализует паттерн Singleton), если позволяет создать всего один объект своего типа.

Реализовать Singleton pattern:
1. Создай класс Singleton в отдельном файле.
2. Добавь в него статический метод getInstance().
3. Метод getInstance должен возвращать один и тот же объект класса Singleton при любом вызове метода getInstance.
4. Подумай, каким образом можно запретить создание других объектов этого класса.
5. Сделай все конструкторы в классе Singleton приватными (private).
6. В итоге должна быть возможность создать объект (экземпляр класса) ТОЛЬКО используя метод getInstance.

Требования:
•	Класс Singleton должен быть создан в отдельном файле.
•	Класс Singleton не должен позволять создавать объекты своего типа извне класса.
*/
public class Solution {
    public static void main(String[] args) {
    }
}
