package syntax.task00.task0002;

/*Комплимент учителю*/
/*
Условия
Написать программу, выводящую на экран надпись "Элли самая красивая" 5 раз. Каждый раз - с новой строки.

Пример вывода на экран:
Элли самая красивая
Элли самая красивая
Элли самая красивая
Элли самая красивая
Элли самая красивая

Требования:
•	Программа должна выводить текст.
•	Текст должен начинаться с "Элли".
•	Текст должен заканчиваться на "красивая".
•	Текст должен состоять из 5 строк.
•	Выводимый текст должен соответствовать заданию.*/
public class Solution {
    public static void main(String[] args) {
        for (int i = 0; i < 5; i++) {
            System.out.println("Элли самая красивая");
        }
    }
}
